# DataPreprocessingWithPandas

`2017/07/25`  `jskyzero` `DataPreProcessing`  `Pandas`

## Import Basic Modules

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

type(pd)

module

## Read CSV Data

In [18]:
df = pd.read_csv('../asset/Median Price of Established House Transfers.txt', sep='\t') # row 3 has a null value 
df.head()

           City Quarter  Price
0        Sydney      Q1  700.0
1   Rest of NSW      Q1  370.0
2     Melbourne      Q1  525.0
3  Rest of Vic.      Q1    NaN
4      Brisbane      Q1  460.0

## Process Missing Data

In [3]:
# find NaN value
df[pd.isnull(df["Price"])]

            City Quarter  Price
3   Rest of Vic.      Q1    NaN
13    Rest of NT      Q1    NaN
21      Adelaide      Q2    NaN
27        Darwin      Q2    NaN
40        Hobart      Q3    NaN
49      Brisbane      Q4    NaN

In [4]:
# fill a value
df2 = df.fillna(0)
df2[pd.isnull(df['Price'])]

            City Quarter  Price
3   Rest of Vic.      Q1    0.0
13    Rest of NT      Q1    0.0
21      Adelaide      Q2    0.0
27        Darwin      Q2    0.0
40        Hobart      Q3    0.0
49      Brisbane      Q4    0.0

In [5]:
# fill a non-null values
df2 = df.fillna(method='pad', axis=0)
df2.head()

           City Quarter  Price
0        Sydney      Q1  700.0
1   Rest of NSW      Q1  370.0
2     Melbourne      Q1  525.0
3  Rest of Vic.      Q1  525.0
4      Brisbane      Q1  460.0

In [6]:
# drop the rows with null values
df2 = df.dropna(axis=0) # if axis = 1, the column will be dropped
df.size - df2.size

18

In [19]:
index_with_null = df[pd.isnull(df["Price"])].index
print(index_with_null)
df["Price"] = df.groupby('City').transform(lambda x : x.fillna(x.mean()))
df.loc[index_with_null]

Int64Index([3, 13, 21, 27, 40, 49], dtype='int64')

            City Quarter       Price
3   Rest of Vic.      Q1  294.666667
13    Rest of NT      Q1  422.500000
21      Adelaide      Q2  420.433333
27        Darwin      Q2  579.166667
40        Hobart      Q3  359.000000
49      Brisbane      Q4  468.633333

## Binning

### Equal-Width

In [21]:
pd.cut(df['Price'], 5).head() # equally partition Price into 5 bins

0      (597.0, 716.0]
1      (359.0, 478.0]
2      (478.0, 597.0]
3    (239.405, 359.0]
4      (359.0, 478.0]
Name: Price, dtype: category
Categories (5, interval[float64]): [(239.405, 359.0] < (359.0, 478.0] < (478.0, 597.0] < (597.0, 716.0] < (716.0, 835.0]]

In [22]:
# add label to the bins
df['Bin'] = pd.cut(df['Price'], 5, labels=["--", "-", "_+", "+", "++"])
df.head()

           City Quarter       Price Bin
0        Sydney      Q1  700.000000   +
1   Rest of NSW      Q1  370.000000   -
2     Melbourne      Q1  525.000000  _+
3  Rest of Vic.      Q1  294.666667  --
4      Brisbane      Q1  460.000000   -

### Equal-Depth

In [27]:
pd.qcut(df['Price'], 5).head()

0      (555.1, 835.0]
1      (336.4, 395.0]
2      (440.5, 555.1]
3    (239.999, 336.4]
4      (440.5, 555.1]
Name: Price, dtype: category
Categories (5, interval[float64]): [(239.999, 336.4] < (336.4, 395.0] < (395.0, 440.5] < (440.5, 555.1] < (555.1, 835.0]]

> 以下弃坑